import numpy as np
X = np.array([[1,1,5,2,3], [0,6,2,1,1], [3, 4,0,3,1], [4, 1,5,6,3]])
from sklearn.decomposition import NMF
model = NMF(n_components=2, alpha=0.01)
W = model.fit_transform(X)
H = model.components_
print (W)
print (H)

# 输出：
# [[ 1.67371185  0.02013017]
#  [ 0.40564826  2.17004352]
#  [ 0.77627836  1.5179425 ]
#  [ 2.66991709  0.00940262]]
# [[ 1.32014421  0.40901559  2.10322743  1.99087019  1.29852389]
#  [ 0.25859086  2.59911791  0.00488947  0.37089193  0.14622829]]
# 从结果可以看出， 第1,3,4,5个文本和第一个隐含主题更相关，而第二个文本与第二个隐含主题更加相关。如果需要下一个结论，我们可以说，第1,3,4,5个文本属于第一个隐含主题，而第二个问题属于第2个隐含主题。
